
{
  "title":"Syllabus",
  "content":" Course Meeting Times Lectures: 3 sessions / week, 1.0 hour / session\nDescription 6.334 examines the application of electronics to energy conversion and control. Topics covered include: modeling, analysis, and control techniques; design of power circuits including inverters, rectifiers, and DC-DC converters; analysis and design of magnetic components and filters; and characteristics of power semiconductor devices. Numerous application examples will be presented such as motion control systems, power supplies, and radio-frequency power amplifiers. The course is worth 6 engineering design points.\nPrerequisite 6.012\nHomework Problem sets will be issued on a weekly basis, and will be due one week after issue unless otherwise specified. Late problem sets will not be accepted unless previously arranged with the TA. Good problems for 6.334 are very difficult to create, so you will sometimes be assigned a problem used in previous years. Under no circumstances are you to use 6.334 \u0026ldquo;bibles\u0026rdquo; to help you with problem sets. You may, however, consult with colleagues who are taking 6.334, or who have taken 6.334 in the past. For those of you without access to such colleagues, many graduate students in LEES have taken 6.334 and are willing to help answer questions if you can\u0026rsquo;t arrange to see the TA or Prof. Perreault.\nQuizzes There will be 2 quizzes in 6.334 this term. The tentative dates for these are due two days after Lec #19 and one day after Lec #34. The exams will be closed book and will be given during the evening, starting at 7:30 pm. There is no final exam.\nGrading Grading will be based on three components:\nACTIVITIES PERCENTAGES Homework 40% Two quizzes (25% each) 50% Design project 10% The project will be issued in early April and tentatively due on Lec #37. As with the homework, consultation with colleagues is permissible, but you must hand in a unique, independently-completed solution.\nRequired Text Kassakian, John G., Martin F. Schlecht, and George C. Verghese. Principles of Power Electronics. Reading, MA: Addison-Wesley, 1991. ISBN: 9780201096897.\nAdditional References Most information you will need is in the course text or will be provided in handouts or references, so purchase of another book is not necessary. Some other books that might prove helpful on occasion are:\nKrein, Philip T. Elements of Power Electronics. New York, NY: Oxford University Press, 1998. ISBN: 9780195117011.\nMohan, Ned, Tore Undeland, and William Robbins. Power Electronics: Converters, Applications, and Design. 2nd ed. New York, NY: John Wiley \u0026amp; Sons, 1995. ISBN: 9780471584087.\nErickson, Robert W. Fundamentals of Power Electronics. New York, NY: Chapman \u0026amp; Hall, 1997. ISBN: 9780412085413.\nRashid, Muhammad H. SPICE for Power Electronics and Electric Power. 2nd ed. Boca Raton, FL: CRC Press, 2006. ISBN: 9780849334184.\nField Trip As part of the class, we will arrange a field trip to the power electronics design and manufacturing facility of Synqor in Boxborough, MA. Synqor is a technology leader in DC/DC converters for telecommunications applications.\n"}


